In [2]:
import numpy as np 
import pandas as pd

## 1. 연습 문제 4.1.1

(1) 임의로 두 개의 시리즈 객체를 만든다. 모두 문자열 인덱스를 가져야 하며 두 시리즈에 공통적으로 포함되지 않는 라벨이 있어야 한다.

(2) 위에서 만든 두 시리즈 객체를 이용하여 사칙 연산을 한다.

In [3]:
# 1)
s1 = pd.Series([1,3,6], index=['a','b','c'])
s2 = pd.Series([2,4,5], index=['a','b','d'])

In [4]:
# 2)
s1 + s2

a    3.0
b    7.0
c    NaN
d    NaN
dtype: float64

In [5]:
s1 * s2

a     2.0
b    12.0
c     NaN
d     NaN
dtype: float64

In [6]:
s1 - s2

a   -1.0
b   -1.0
c    NaN
d    NaN
dtype: float64

In [7]:
s1 / s2

a    0.50
b    0.75
c     NaN
d     NaN
dtype: float64

## 연습 문제 4.1.2

다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다.

(1) 열의 갯수와 행의 갯수가 각각 5개 이상이어야 한다.

(2) 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 한다.

In [8]:
pd.DataFrame({
    'int1':[1,2,3,4,5],
    'int2':[10,20,30,40,50],
    'int3':[100,200,300,400,500],
    'string':['a','b','c','d','e'],
    'float':[3.14,1.414,1.732,2.718,2.235]
})

   int1  int2  int3 string  float
0     1    10   100      a  3.140
1     2    20   200      b  1.414
2     3    30   300      c  1.732
3     4    40   400      d  2.718
4     5    50   500      e  2.235

## 연습 문제 4.1.3

다음 데이터프레임에서 지정하는 데이터를 뽑아내거나 처리하라.

data = {
    "국어": \[80, 90, 70, 30],
    "영어": \[90, 70, 60, 40],
    "수학": \[90, 60, 80, 70],
}

columns = \["국어", "영어", "수학"]

index = \["춘향", "몽룡", "향단", "방자"]

df = pd.DataFrame(data, index=index, columns=columns)


(1) 모든 학생의 수학 점수를 시리즈로 나타낸다.

(2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.

(3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.

(4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.

(5) 춘향의 점수를 데이터프레임으로 나타낸다.

(6) 향단의 점수를 시리즈로 나타낸다.

In [9]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [10]:
# 1)
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [11]:
# 2)
df[['국어','영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [12]:
# 3)
df['평균'] = np.round(df.mean(axis=1), 2)
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [13]:
# 4)
del df['평균']
df['영어'][3] = 80
df['평균'] = np.round(df.mean(axis=1), 2)
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  60.00

In [15]:
# 5)
df[:'춘향']

    국어  영어  수학     평균
춘향  80  90  90  86.67

In [16]:
df.T['향단']

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

## 연습 문제 4.3.1

모든 행과 열에 라벨을 가지는 5 x 5 이상의 크기를 가지는 데이터프레임을 만든다.

10가지 이상의 방법으로 특정한 행과 열을 선택한다.

In [17]:
# 1)
np.random.seed(2021)
df = pd.DataFrame(np.random.randint(1, 100, 25).reshape(5,5),
                  index=['a','b','c','d','e'],
                  columns=['v','w','x','y','z'])
df

    v   w   x   y   z
a  86  58   1  95  87
b  45  63  92  30  22
c  94  25  13  71  71
d  34   8   2  98  27
e  67  49  64  50  17

In [18]:
# 2) 63을 선택
# 값부르기
df['w']['b'], df.w['b'], df.w[1], df.w.b

(63, 63, 63, 63)

In [19]:
#loc 이용
df.loc['b','w'], df.loc['b']['w'], df.loc['b'][1]

(63, 63, 63)

In [20]:
#iloc 이용
df.iloc[1,1], df.iloc[1][1], df.iloc[1]['w']

(63, 63, 63)

## 연습 문제 4.4.1

타이타닉호 승객 데이터의 데이터 개수를 각 열마다 구해본다.

In [21]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

## 연습 문제 4.4.2

sort_values 메서드를 사용하여 타이타닉호 승객에 대해 성별(sex) 인원수, 나이별(age) 인원수, 선실별(class) 인원수, 사망/생존(alive) 인원수를 구하라.

In [24]:
#성별(sex) 인원수
titanic.sex.value_counts().sort_values()

female    314
male      577
Name: sex, dtype: int64

In [23]:
#나이별(age) 인원수
titanic.age.value_counts().sort_values()

12.00     1
24.50     1
66.00     1
20.50     1
0.67      1
         ..
19.00    25
28.00    25
18.00    26
22.00    27
24.00    30
Name: age, Length: 88, dtype: int64

In [25]:
#선실별(class) 인원수
titanic['class'].value_counts().sort_values()

Second    184
First     216
Third     491
Name: class, dtype: int64

In [26]:
#사망/생존(alive) 인원수
titanic.alive.value_counts().sort_values()

yes    342
no     549
Name: alive, dtype: int64

## 연습 문제 4.4.3

타이타닉호 승객의 평균 나이를 구하라.

타이타닉호 승객중 여성 승객의 평균 나이를 구하라.

타이타닉호 승객중 1등실 선실의 여성 승객의 평균 나이를 구하라.

In [27]:
# 1) 타이타닉호 승객의 평균 나이
titanic.age.mean()

29.69911764705882

In [29]:
#타이타닉호 승객중 여성 승객의 평균 나이
titanic[titanic.sex == 'female'].age.mean()

27.915708812260537

In [28]:
#1등실 선실의 여성 승객의 평균 나이
dft = titanic[titanic.pclass == 1]
dft[dft.sex == 'female'].age.mean()

34.61176470588235

## 연습 문제 4.4.4

타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category1 열을 만들어라. category1 카테고리는 다음과 같이 정의된다.

20살이 넘으면 성별을 그대로 사용한다.

20살 미만이면 성별에 관계없이 “child”라고 한다.

In [30]:
titanic = sns.load_dataset('titanic')
titanic = titanic[['survived','pclass','sex','age']]

In [31]:
# warning 무시 코드
import warnings
warnings.filterwarnings('ignore')

In [32]:
titanic['category1'] = titanic.apply(
    lambda r: r.sex if r.age >= 20 else 'child', axis=1
)
titanic.tail()

     survived  pclass     sex   age category1
886         0       2    male  27.0      male
887         1       1  female  19.0     child
888         0       3  female   NaN     child
889         1       1    male  26.0      male
890         0       3    male  32.0      male

## 연습 문제 4.4.5

타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값이 되도록 titanic 데이터프레임을 고쳐라.

In [33]:
# titanic['age'] = titanic.age.fillna(np.round(titanic.age.mean()))
titanic.age.fillna(np.round(titanic.age.mean()), inplace=True)
titanic.tail()

     survived  pclass     sex   age category1
886         0       2    male  27.0      male
887         1       1  female  19.0     child
888         0       3  female  30.0     child
889         1       1    male  26.0      male
890         0       3    male  32.0      male

## 연습 문제 4.4.6

타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category2 열을 만들어라. category2 카테고리는 다음과 같이 정의된다.

성별을 나타내는 문자열 male 또는 female로 시작한다.

성별을 나타내는 문자열 뒤에 나이를 나타내는 문자열이 온다.

예를 들어 27살 남성은 male27 값이 된다.

In [34]:
titanic['category2'] = titanic.sex + titanic.age.astype(int).astype(str)
titanic.tail()

     survived  pclass     sex   age category1 category2
886         0       2    male  27.0      male    male27
887         1       1  female  19.0     child  female19
888         0       3  female  30.0     child  female30
889         1       1    male  26.0      male    male26
890         0       3    male  32.0      male    male32

## 연습 문제 4.4.7

타이타닉호 승객을 ‘미성년자’, ‘청년’, ‘중년’, ‘장년’, ‘노년’ 나이 그룹으로 나눈다.

bins = \[1, 20, 30, 50, 70, 100]

labels = \["미성년자", "청년", "중년", "장년", "노년"]

그리고 각 나이 그룹의 승객 비율을 구한다. 비율의 전체 합은 1이 되어야 한다.

In [36]:
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
cats = pd.cut(titanic.age.values, bins, labels=labels)
cats.value_counts()

미성년자    165
청년      407
중년      241
장년       59
노년        5
dtype: int64

In [37]:
df = pd.DataFrame(cats.value_counts(), columns=['인원수'])
df

      인원수
미성년자  165
청년    407
중년    241
장년     59
노년      5

In [38]:
df['비율(%)'] = np.round(df['인원수'] / df['인원수'].sum() * 100, 2)
df

      인원수  비율(%)
미성년자  165  18.81
청년    407  46.41
중년    241  27.48
장년     59   6.73
노년      5   0.57

In [40]:
# 합이 100% 되는지 확인
df['비율(%)'].sum()

100.0

## 연습 문제 4.4.8

타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category3 열을 만들어라. category3 카테고리는 다음과 같이 정의된다.

20살 미만이면 성별에 관계없이 “미성년자”라고 한다.

20살 이상이면 나이에 따라 “청년”, “중년”, “장년”, “노년”을 구분하고 그 뒤에 성별을 나타내는 “남성”, “여성”을 붙인다.

In [41]:
titanic['group'] = pd.cut(titanic.age.values, bins, labels=labels)
titanic.tail()

     survived  pclass     sex   age category1 category2 group
886         0       2    male  27.0      male    male27    청년
887         1       1  female  19.0     child  female19  미성년자
888         0       3  female  30.0     child  female30    청년
889         1       1    male  26.0      male    male26    청년
890         0       3    male  32.0      male    male32    중년

In [42]:
titanic['성별'] = titanic.apply(lambda r: '남성' if r.sex == 'male' else '여성', axis=1)
titanic.tail()

     survived  pclass     sex   age category1 category2 group  성별
886         0       2    male  27.0      male    male27    청년  남성
887         1       1  female  19.0     child  female19  미성년자  여성
888         0       3  female  30.0     child  female30    청년  여성
889         1       1    male  26.0      male    male26    청년  남성
890         0       3    male  32.0      male    male32    중년  남성

In [43]:
titanic['category3'] = titanic.apply(
    lambda r: r.group + r.성별 if r.age >= 20 else '미성년자', 
    axis=1
)
titanic.tail()

     survived  pclass     sex   age category1 category2 group  성별 category3
886         0       2    male  27.0      male    male27    청년  남성      청년남성
887         1       1  female  19.0     child  female19  미성년자  여성      미성년자
888         0       3  female  30.0     child  female30    청년  여성      청년여성
889         1       1    male  26.0      male    male26    청년  남성      청년남성
890         0       3    male  32.0      male    male32    중년  남성      중년남성

## 연습 문제 4.5.1

5명의 학생의 국어, 영어, 수학 점수를 나타내는 데이터프레임을 다음과 같이 만든다.

학생 이름을 나타내는 열을 포함시키지 않고 데이터프레임 df_score1 을 생성한 후, df_score1.index 속성에 학생 이름을 나타내는 열을 지정하여 인덱스를 지정한다. reset_index 명령으로 이 인덱스 열을 명령으로 일반 데이터열로 바꾸여 데이터프레임 df_score2을 만든다.

학생 이름을 나타내는 열이 일반 데이터 열을 포함하는 데이터프레임 df_score2에 set_index 명령을 적용하여 다시 학생 이름을 나타내는 열을 인덱스로 변경한다.

In [45]:
#데이터프레임 df_score1 을 생성
np.random.seed(2021)
df_score1 = pd.DataFrame(np.random.randint(40, 100, 15).reshape(5,3), 
                         columns=['국어','영어','수학'])
                         
# df_score1.index 속성에 학생 이름을 나타내는 열을 지정하여 인덱스를 지정
df_score1.index = ['김판다','이판다','박판다','최판다','정판다']
df_score1.index.name = '이름'
df_score1

     국어  영어  수학
이름
김판다  92  61  97
이판다  40  85  70
박판다  62  84  67
최판다  69  61  69
정판다  64  52  94

In [47]:
#reset_index 명령, 일반 데이터열로 바꾸여 데이터프레임 df_score2생성
df_score2 = df_score1.reset_index()
df_score2

    이름  국어  영어  수학
0  김판다  92  61  97
1  이판다  40  85  70
2  박판다  62  84  67
3  최판다  69  61  69
4  정판다  64  52  94

In [49]:
# df_score2에 set_index 명령을 적용하여 다시 학생 이름을 나타내는 열을 인덱스로 변경
df_score2.set_index('이름')

     국어  영어  수학
이름
김판다  92  61  97
이판다  40  85  70
박판다  62  84  67
최판다  69  61  69
정판다  64  52  94